system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoReactingMultiphaseInterFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.0003;

deltaT          1e-9;

writeControl    adjustable;

writeInterval   1e-5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxDeltaT       3.35e-7;

maxCo           1.;

maxAlphaCo      1.;

maxAlphaDdt     2.3;

maxDi           25;

/*functions
{
   limitliquid
   {
	type     limitFields;
	libs     (fieldFunctionObjects);

	fields   (alpha.liquid);
	limit    both;
	min      -0.1;
	max      1.1;





   }





}
*/
// ************************************************************************* //
