constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4000;
        startFace       707600;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4000;
        startFace       711600;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6000;
        startFace       715600;
    }
    top
    {
        type            patch;
        nFaces          6000;
        startFace       721600;
    }
    front
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2400;
        startFace       727600;
    }
    back
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2400;
        startFace       730000;
    }
)

// ************************************************************************* //
