constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       on;

radiationModel  laserDTRM;


// Number of flow iterations per radiation iteration
solverFreq 1;

absorptionEmissionModel localDensityAbsorptionEmission;
	mode	"Gaussian";
	nTheta	50;
	nr 	30;
	//opd	0.0001;
	focalLaserPosition constant 	(0.0002 0.0002 0.00014);
	/*focalLaserPosition table
	(
	    (0 (0.0001 0.0002 0.00014))
	    (0.001 (0.0013 0.0002 0.00014))
	    
	);*/
	laserDirection constant 	(0 0 -1);
	focalLaserRadius 		86e-6;
	laserPower			40;
	sigma				45e-6;
	//qualityBeamLaser		1.0;

localDensityAbsorptionEmissionCoeffs
    {
        alphaNames (alpha.liquid alpha.solid alpha.gas);
        aCoeff (2.5e4 1e5 0); //1e4-1e6
        eCoeff (0.4 0.4 0);
        ECoeff (0 0 0);
    }

scatterModel    none;

sootModel       none;

transmissivityModel none;

// ************************************************************************* //
