0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    left
    {
        type            fixedFluxPressure;
        value           uniform 1e5;	
    }

    right
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    bottom
    {
	
	type            fixedFluxPressure;
        value           uniform 1e5;
    }

    top
    {	
	type            prghTotalPressure;
        p0              $internalField;
        value           uniform 100000;       
    }

    front
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }
    back
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }
}


// ************************************************************************* //
