system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.gas 1
    volScalarFieldValue alpha.solid 0
    volScalarFieldValue alpha.liquid 0
);

regions
(
    boxToCell 
 { 
   box (0.000 0.000 0.0000) (0.0005 0.0003 0.0001);
   fieldValues 
 ( 
		volScalarFieldValue alpha.solid 1 
		volScalarFieldValue alpha.gas 0 
		volScalarFieldValue alpha.liquid 0
 ); 
 }   

  sphereToCell 
 { 
centre (0.00019 0.0002 0.000111);
radius 0.000011;
 fieldValues 
 ( 
		volScalarFieldValue alpha.solid 1 
		volScalarFieldValue alpha.gas 0 
		volScalarFieldValue alpha.liquid 0
 ); 
 } 
sphereToCell 
 { 
centre (0.00022 0.0002 0.000111);
radius 0.000011;
 fieldValues 
 ( 
		volScalarFieldValue alpha.solid 1 
		volScalarFieldValue alpha.gas 0 
		volScalarFieldValue alpha.liquid 0
 ); 
 } 


);
// ************************************************************************* //
